---
title: RoofFailures
classe: Autodesk.Revit.DB.BuiltInFailures+RoofFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 23
---

# RoofFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId CurveRoofSkippedLoops { get; }` | `RoofFailures.CurveRoofSkippedLoops` | FailureDefinitionId |
| `FailureDefinitionId CurveRoofSkippedLoopsError { get; }` | `RoofFailures.CurveRoofSkippedLoopsError` | FailureDefinitionId |
| `FailureDefinitionId CurveRoofSkippedLoopsWarn { get; }` | `RoofFailures.CurveRoofSkippedLoopsWarn` | FailureDefinitionId |
| `FailureDefinitionId ExtrudedRoofCutBySketch { get; }` | `RoofFailures.ExtrudedRoofCutBySketch` | FailureDefinitionId |
| `FailureDefinitionId HadToAlignEaves { get; }` | `RoofFailures.HadToAlignEaves` | FailureDefinitionId |
| `FailureDefinitionId HoleInRoofFailed { get; }` | `RoofFailures.HoleInRoofFailed` | FailureDefinitionId |
| `FailureDefinitionId InvalidArcSegmentation { get; }` | `RoofFailures.InvalidArcSegmentation` | FailureDefinitionId |
| `FailureDefinitionId JoinedRoofMissesTarget { get; }` | `RoofFailures.JoinedRoofMissesTarget` | FailureDefinitionId |
| `FailureDefinitionId JoinedRoofMissesTargetError { get; }` | `RoofFailures.JoinedRoofMissesTargetError` | FailureDefinitionId |
| `FailureDefinitionId NoFlatCurtainRoofs { get; }` | `RoofFailures.NoFlatCurtainRoofs` | FailureDefinitionId |
| `FailureDefinitionId OnlyOneSlopeCurtainRoof { get; }` | `RoofFailures.OnlyOneSlopeCurtainRoof` | FailureDefinitionId |
| `FailureDefinitionId OnlyUpwardFacesUsed { get; }` | `RoofFailures.OnlyUpwardFacesUsed` | FailureDefinitionId |
| `FailureDefinitionId RoofCutoffRemoved { get; }` | `RoofFailures.RoofCutoffRemoved` | FailureDefinitionId |
| `FailureDefinitionId RoofExceedsMaxHeight { get; }` | `RoofFailures.RoofExceedsMaxHeight` | FailureDefinitionId |
| `FailureDefinitionId RoofMeetsRoofTangentially { get; }` | `RoofFailures.RoofMeetsRoofTangentially` | FailureDefinitionId |
| `FailureDefinitionId RoofMeetsRoofTangentiallyError { get; }` | `RoofFailures.RoofMeetsRoofTangentiallyError` | FailureDefinitionId |
| `FailureDefinitionId RoofSlopeExceedsThreshold { get; }` | `RoofFailures.RoofSlopeExceedsThreshold` | FailureDefinitionId |
| `FailureDefinitionId RoofToRefPlanes { get; }` | `RoofFailures.RoofToRefPlanes` | FailureDefinitionId |
| `FailureDefinitionId RoofToRefPlanesError { get; }` | `RoofFailures.RoofToRefPlanesError` | FailureDefinitionId |
| `FailureDefinitionId UnusedSlopeArrow { get; }` | `RoofFailures.UnusedSlopeArrow` | FailureDefinitionId |
| `FailureDefinitionId UptoHeightTooLow { get; }` | `RoofFailures.UptoHeightTooLow` | FailureDefinitionId |
| `FailureDefinitionId UserCancelledRoof { get; }` | `RoofFailures.UserCancelledRoof` | FailureDefinitionId |
| `FailureDefinitionId WorkplaneShouldBeLevel { get; }` | `RoofFailures.WorkplaneShouldBeLevel` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```